tap "rsteube/tap"

brew "atuin" # Improved shell history
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "colima" # Container runtimes on macOS with minimal setup
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "docker-credential-helper"
brew "docker"
brew "fastfetch" # faster neofetch alternative
brew "ffmpeg"
brew "fzf" # Command-line fuzzy finder
brew "gh" # GitHub command-line tool
brew "ghostscript" # Interpreter for PostScript and PDF
brew "git"
brew "htop" # Interactive process viewer
brew "imagemagick" # Image manipulation
brew "jq" # Command-line JSON processor
brew "mas" # Mac App Store command-line interface
brew "n" # Node version management
brew "ncdu" # Disk usage analyzer with an ncurses interface
brew "neovim"
brew "nushell"
brew "p7zip"
brew "python@3"
brew "qpdf" # Command-line PDF toolkit
brew "ripgrep" # Better search tool
brew "rsteube/tap/carapace" # A multi-shell completion binary
brew "sd" # Modern alternative to sed
brew "starship" # Cross-shell prompt
brew "stow" # Symlink farm manager
brew "tmux"
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "zellij" # Modern terminal multiplexer
brew "zoxide" # Shell extension to navigate filesystem faster
cask "1password"
cask "bettermouse" # Utility improving 3rd party mouse performance and functionalities
cask "calibre" # E-books management software
cask "firefox"
cask "ghostty"
cask "gimp"
cask "github"
cask "google-chrome"
cask "hammerspoon" # Desktop automation application
cask "homerow" # Keyboard shortcuts for UI navigation
cask "inkscape" # Vector graphics editor
cask "insomnia"
cask "jordanbaird-ice" # Menu bar manager
cask "keycastr" # Open-source keystroke visualiser
# cask "keymapp" # ZSA keyboard firmware flasher
cask "localsend" # Easy file sharing over local network
cask "notion"
cask "obsidian"
cask "ollama-app"
cask "postman"
cask "setapp" # Collection of apps available by subscription
cask "spotify"
cask "startupfolder" # Manage login items
# cask "tunnelblick" # Free and open-source OpenVPN client
cask "visual-studio-code"
cask "vlc"

# Team Communication and Collaboration Software
cask "slack"

# GNU Utils
brew "coreutils" # GNU File, Shell, and Text utilities
brew "findutils" # Collection of GNU find, xargs, and locate

# Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono"

# Mac App Store Apps
mas "1Password for Safari", id: 1569813296
mas "Anybox", id: 1593408455
mas "Consent-O-Matic", id: 1606897889
mas "Magnet", id: 441258766
mas "Perplexity", id: 6714467650
mas "Reeder", id: 1529448980
mas "ScreenBrush", id: 1233965871
mas "Synology Image Assistant Extension", id: 6503120862
# mas "Xcode", id: 497799835
